#### 📖 Terraform Plan ('src/common/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
ariable name="urlId" value="@{
                        Random rnd = new Random();
          -             int urlId = rnd.Next(1, 3);
          +             int urlId = rnd.Next(1, 4);
                        return urlId.ToString();
          -         }" />
          - 		<choose>
          - 			<when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
          - 				<set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net" />
          - 			</when>
          - 			<when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
          - 				<set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net" />
          - 			</when>
          - 			<otherwise>
          - 				<return-response>
          - 					<set-status code="500" reason="InternalServerError" />
          - 					<set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
          - 						<value>@{return Guid.NewGuid().ToString();}</value>
          - 					</set-header>
          - 					<set-body>A gateway-related error occurred while processing the request.</set-body>
          - 				</return-response>
          - 			</otherwise>
          - 		</choose>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          +         }" />
          +         <choose>
          +             <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
          +                 <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net" />
          +             </when>
          +             <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
          +                 <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net" />
          +             </when>
          +             <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("3"))">
          +                 <set-backend-service base-url="https://io-p-app-appbackendl3.azurewebsites.net" />
          +             </when>
          +             <otherwise>
          +                 <return-response>
          +                     <set-status code="500" reason="InternalServerError" />
          +                     <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
          +                         <value>@{return Guid.NewGuid().ToString();}</value>
          +                     </set-header>
          +                     <set-body>A gateway-related error occurred while processing the request.</set-body>
          +                 </return-response>
          +             </otherwise>
          +         </choose>
          +     </inbound>
          +     <outbound>
          +         <base />
          +     </outbound>
          +     <backend>
          +         <base />
          +     </backend>
          +     <on-error>
          +         <base />
          +     </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.platform_api_gateway_apim_itn.azurerm_api_management_api_policy.platform_legacy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "platform_legacy" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-p-platform-legacy-api"
      ~ xml_content         = <<-EOT
          - <!--
          -     IMPORTANT:
          -     - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
          -     - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
          -     - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
          -     - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
          -     - To remove a policy, delete the corresponding policy statement from the policy document.
          -     - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
          -     - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
          -     - Policies are applied in the order of their appearance, from the top down.
          -     - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
          - -->
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<!-- This line rewrites the request URI by removing "/platform-legacy" from the original URL path -->
          - 		<rewrite-uri template="@(context.Request.OriginalUrl.Path.Replace("/platform-legacy", ""))" />
          - 		<!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
          - 		<set-variable name="urlId" value="@{
          + <!--
          +     IMPORTANT:
          +     - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
          +     - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
          +     - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
          +     - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
          +     - To remove a policy, delete the corresponding policy statement from the policy document.
          +     - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
          +     - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
          +     - Policies are applied in the order of their appearance, from the top down.
          +     - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
          + -->
          + <policies>
          +     <inbound>
          +         <base />
          +         <!-- This line rewrites the request URI by removing "/platform-legacy" from the original URL path -->
          +         <rewrite-uri template="@(context.Request.OriginalUrl.Path.Replace("/platform-legacy", ""))" />
          +         <!-- https://docs.microsoft.com/en-us/dotnet/api/system.random.next?view=net-6.0#system-random-next(system-int32-system-int32) -->
          +         <set-variable name="urlId" value="@{
                        Random rnd = new Random();
          -             int urlId = rnd.Next(1, 3);
          +             int urlId = rnd.Next(1, 4);
                        return urlId.ToString();
          -         }" />
          - 		<choose>
          - 			<when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
          - 				<set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net" />
          - 			</when>
          - 			<when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
          - 				<set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net" />
          - 			</when>
          - 			<otherwise>
          - 				<return-response>
          - 					<set-status code="500" reason="InternalServerError" />
          - 					<set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
          - 						<value>@{return Guid.NewGuid().ToString();}</value>
          - 					</set-header>
          - 					<set-body>A gateway-related error occurred while processing the request.</set-body>
          - 				</return-response>
          - 			</otherwise>
          - 		</choose>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          +         }" />
          +         <choose>
          +             <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("1"))">
          +                 <set-backend-service base-url="https://io-p-app-appbackendl1.azurewebsites.net" />
          +             </when>
          +             <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("2"))">
          +                 <set-backend-service base-url="https://io-p-app-appbackendl2.azurewebsites.net" />
          +             </when>
          +             <when condition="@(context.Variables.GetValueOrDefault<string>("urlId").Equals("3"))">
          +                 <set-backend-service base-url="https://io-p-app-appbackendl3.azurewebsites.net" />
          +             </when>
          +             <otherwise>
          +                 <return-response>
          +                     <set-status code="500" reason="InternalServerError" />
          +                     <set-header name="Microsoft-Azure-Api-Management-Correlation-Id" exists-action="override">
          +                         <value>@{return Guid.NewGuid().ToString();}</value>
          +                     </set-header>
          +                     <set-body>A gateway-related error occurred while processing the request.</set-body>
          +                 </return-response>
          +             </otherwise>
          +         </choose>
          +     </inbound>
          +     <outbound>
          +         <base />
          +     </outbound>
          +     <backend>
          +         <base />
          +     </backend>
          +     <on-error>
          +         <base />
          +     </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.app_backend_weu["3"].module.appservice_app_backend.azurerm_app_service_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.app_backend_weu["3"].module.appservice_app_backend.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "ALLOW_MYPORTAL_IP_SOURCE_RANGE"                  = (sensitive value)
          + "ALLOW_NOTIFY_IP_SOURCE_RANGE"                    = "127.0.0.0/0"
          + "API_BASE_PATH"                                   = "/api/v1"
          + "API_KEY"                                         = (sensitive value)
          + "API_URL"                                         = "https://io-p-itn-auth-profile-func-02.azurewebsites.net/api/v1"
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendl3"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = (sensitive value)
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          + "APP_MESSAGES_API_KEY"                            = (sensitive value)
          + "APP_MESSAGES_API_URL"                            = "https://io-p-itn-com-citizen-func-01.azurewebsites.net/api/v1"
          + "AUTHENTICATION_BASE_PATH"                        = null
          + "BONUS_API_BASE_PATH"                             = "/api/v1"
          + "BONUS_API_KEY"                                   = "to-remove"
          + "BONUS_API_URL"                                   = "to-remove"
          + "CGN_API_BASE_PATH"                               = "/api/v1/cgn"
          + "CGN_API_KEY"                                     = (sensitive value)
          + "CGN_API_URL"                                     = "https://io-p-itn-cgn-card-func-02.azurewebsites.net"
          + "CGN_OPERATOR_SEARCH_API_BASE_PATH"               = "/api/v1/cgn/operator-search"
          + "CGN_OPERATOR_SEARCH_API_KEY"                     = (sensitive value)
          + "CGN_OPERATOR_SEARCH_API_URL"                     = "https://io-p-itn-cgn-search-func-02.azurewebsites.net"
          + "EUCOVIDCERT_API_BASE_PATH"                       = "/api/v1/eucovidcert"
          + "EUCOVIDCERT_API_KEY"                             = (sensitive value)
          + "EUCOVIDCERT_API_URL"                             = "https://io-p-eucovidcert-fn.azurewebsites.net/api/v1"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FF_BONUS_ENABLED"                                = "1"
          + "FF_CGN_ENABLED"                                  = "1"
          + "FF_EUCOVIDCERT_ENABLED"                          = "1"
          + "FF_IO_FIMS_ENABLED"                              = "1"
          + "FF_IO_SIGN_ENABLED"                              = "1"
          + "FF_IO_WALLET_ENABLED"                            = "1"
          + "FF_IO_WALLET_TRIAL_ENABLED"                      = "0"
          + "FF_IO_X_USER_TOKEN"                              = "NONE"
          + "FF_IO_X_USER_TOKEN_BETA_TESTER_SHA_LIST"         = (sensitive value)
          + "FF_IO_X_USER_TOKEN_CANARY_SHA_USERS_REGEX"       = "XYZ"
          + "FF_PN_ACTIVATION_ENABLED"                        = "1"
          + "FF_ROUTING_PUSH_NOTIF"                           = "ALL"
          + "FF_ROUTING_PUSH_NOTIF_BETA_TESTER_SHA_LIST"      = (sensitive value)
          + "FF_ROUTING_PUSH_NOTIF_CANARY_SHA_USERS_REGEX"    = "^([(0-9)|(a-f)|(A-F)]{63}[(0-4)]{1})$"
          + "FF_TRIAL_SYSTEM_ENABLED"                         = "1"
          + "FF_UNIQUE_EMAIL_ENFORCEMENT"                     = "ALL"
          + "IO_FIMS_API_BASE_PATH"                           = "/api/v1/fims"
          + "IO_FIMS_API_KEY"                                 = (sensitive value)
          + "IO_FIMS_API_URL"                                 = "https://io-p-itn-fims-user-func-01.azurewebsites.net"
          + "IO_SIGN_API_BASE_PATH"                           = "/api/v1/sign"
          + "IO_SIGN_API_KEY"                                 = (sensitive value)
          + "IO_SIGN_API_URL"                                 = "https://io-p-sign-user-func.azurewebsites.net"
          + "IO_SIGN_SERVICE_ID"                              = "01GQQZ9HF5GAPRVKJM1VDAVFHM"
          + "IO_WALLET_API_BASE_PATH"                         = "/api/v1/wallet"
          + "IO_WALLET_API_KEY"                               = (sensitive value)
          + "IO_WALLET_API_URL"                               = "https://io-p-itn-wallet-user-func-02.azurewebsites.net"
          + "IO_WALLET_TRIAL_ID"                              = "01J2GN4TA8FB6DPTAX3T3YD6M1"
          + "IO_WALLET_UAT_API_BASE_PATH"                     = "/api/v1/wallet/uat"
          + "IO_WALLET_UAT_API_KEY"                           = (sensitive value)
          + "IO_WALLET_UAT_API_URL"                           = "https://io-u-itn-wallet-user-func-01.azurewebsites.net/api/v1/wallet"
          + "JWT_SUPPORT_TOKEN_EXPIRATION"                    = "1209600"
          + "JWT_SUPPORT_TOKEN_ISSUER"                        = "app-backend.io.italia.it"
          + "JWT_SUPPORT_TOKEN_PRIVATE_RSA_KEY"               = (sensitive value)
          + "LOLLIPOP_API_BASE_PATH"                          = "/api/v1"
          + "LOLLIPOP_API_KEY"                                = (sensitive value)
          + "LOLLIPOP_API_URL"                                = "https://io-p-itn-auth-lollipop-func-02.azurewebsites.net"
          + "MYPORTAL_BASE_PATH"                              = "/myportal/api/v1"
          + "NODE_ENV"                                        = "production"
          + "NOTIFICATIONS_QUEUE_NAME"                        = "push-notifications"
          + "NOTIFICATIONS_STORAGE_CONNECTION_STRING"         = (sensitive value)
          + "PAGOPA_API_KEY_PROD"                             = (sensitive value)
          + "PAGOPA_API_KEY_UAT"                              = (sensitive value)
          + "PAGOPA_API_URL_PROD"                             = "https://api.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_API_URL_TEST"                             = "https://api.uat.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_ECOMMERCE_API_KEY"                        = (sensitive value)
          + "PAGOPA_ECOMMERCE_BASE_URL"                       = "https://api.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PAGOPA_ECOMMERCE_UAT_API_KEY"                    = (sensitive value)
          + "PAGOPA_ECOMMERCE_UAT_BASE_URL"                   = "https://api.uat.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PECSERVERS_aruba_basePath"                       = "/apigateway/api/v2/pagopa/mailbox"
          + "PECSERVERS_aruba_secret"                         = (sensitive value)
          + "PECSERVERS_aruba_serviceId"                      = "01FRMRD5P7H378MDXBBW3DTYCF"
          + "PECSERVERS_aruba_url"                            = "https://pagopa-test.pec.aruba.it"
          + "PECSERVERS_poste_basePath"                       = null
          + "PECSERVERS_poste_secret"                         = (sensitive value)
          + "PECSERVERS_poste_serviceId"                      = "01FQ4945RG5WJGPHKY8ZYRJMQ7"
          + "PECSERVERS_poste_url"                            = "https://poc.pagopa.poste.it"
          + "PECSERVER_BASE_PATH"                             = null
          + "PECSERVER_TOKEN_ISSUER"                          = "app-backend.io.italia.it"
          + "PECSERVER_TOKEN_SECRET"                          = (sensitive value)
          + "PECSERVER_URL"                                   = "https://poc.pagopa.poste.it"
          + "PN_ACTIVATION_BASE_PATH"                         = "/api/v1/pn"
          + "PN_API_KEY"                                      = (sensitive value)
          + "PN_API_KEY_UAT"                                  = (sensitive value)
          + "PN_API_URL"                                      = "https://api-io.notifichedigitali.it"
          + "PN_API_URL_UAT"                                  = "https://api-io.uat.notifichedigitali.it"
          + "PN_CONFIGURATION_ID"                             = "01HMVMHCZZ8D0VTFWMRHBM5D6F"
          + "PN_SERVICE_ID"                                   = "01G40DWQGKY5GRWSNM4303VNRP"
          + "PUSH_NOTIFICATIONS_QUEUE_NAME"                   = "push-notifications"
          + "PUSH_NOTIFICATIONS_STORAGE_CONNECTION_STRING"    = (sensitive value)
          + "REDIS_PASSWORD"                                  = (sensitive value)
          + "REDIS_PORT"                                      = (sensitive value)
          + "REDIS_URL"                                       = (sensitive value)
          + "SERVICES_APP_BACKEND_API_BASE_PATH"              = "/api/v1"
          + "SERVICES_APP_BACKEND_API_URL"                    = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
          + "SERVICES_APP_BACKEND_BASE_PATH"                  = "/api/v2"
          + "TEST_CGN_FISCAL_CODES"                           = null
          + "THIRD_PARTY_CONFIG_LIST"                         = (sensitive value)
          + "TRIAL_SYSTEM_APIM_BASE_PATH"                     = "/manage/api/v1"
          + "TRIAL_SYSTEM_APIM_KEY"                           = (sensitive value)
          + "TRIAL_SYSTEM_APIM_URL"                           = "https://ts-p-itn-apim-01.azure-api.net"
          + "TRIAL_SYSTEM_API_BASE_PATH"                      = "/api/v1"
          + "TRIAL_SYSTEM_API_KEY"                            = (sensitive value)
          + "TRIAL_SYSTEM_API_URL"                            = "https://ts-p-itn-api-func-01.azurewebsites.net"
          + "UNIQUE_EMAIL_ENFORCEMENT_USERS"                  = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_HEALTHCHECK_MAXUNHEALTHYWORKERPERCENT"   = "95"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "io-p-app-appbackendl3"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "io-p-rg-linux"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "npm run start"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "20-lts"
            }

          + auto_heal_setting {
              + action {
                  + action_type                    = "Recycle"
                  + minimum_process_execution_time = "00:05:00"
                }
              + trigger {
                  + slow_request {
                      + count      = 50
                      + interval   = "00:01:00"
                      + time_taken = "00:00:10"
                    }
                }
            }

          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-platform-api-gateway-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-agw-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-platform-api-gateway-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-agw-snet-01"
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.96/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.112/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.128/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.144/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.160/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.176/28"
              + name       = "rule"
              + priority   = 65000
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "APPINSIGHTS_CLOUD_ROLE_NAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
            ]
        }
    }

  # module.app_backend_weu["3"].module.appservice_app_backend.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "westeurope"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "io-p-plan-appappbackendl3"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = true
      + reserved                        = (known after apply)
      + resource_group_name             = "io-p-rg-linux"
      + sku_name                        = "P1v3"
      + tags                            = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + worker_count                    = (known after apply)
      + zone_balancing_enabled          = false
    }

  # module.app_backend_weu["3"].module.appservice_app_backend_slot_staging.azurerm_app_service_slot_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] will be created
  + resource "azurerm_app_service_slot_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + slot_name      = "staging"
      + subnet_id      = (known after apply)
    }

  # module.app_backend_weu["3"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "ALLOW_MYPORTAL_IP_SOURCE_RANGE"                  = (sensitive value)
          + "ALLOW_NOTIFY_IP_SOURCE_RANGE"                    = "127.0.0.0/0"
          + "API_BASE_PATH"                                   = "/api/v1"
          + "API_KEY"                                         = (sensitive value)
          + "API_URL"                                         = "https://io-p-itn-auth-profile-func-02.azurewebsites.net/api/v1"
          + "APPINSIGHTS_CLOUD_ROLE_NAME"                     = "io-p-app-appbackendl3-staging"
          + "APPINSIGHTS_CONNECTION_STRING"                   = (sensitive value)
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = (sensitive value)
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          + "APP_MESSAGES_API_KEY"                            = (sensitive value)
          + "APP_MESSAGES_API_URL"                            = "https://io-p-itn-com-citizen-func-01.azurewebsites.net/api/v1"
          + "AUTHENTICATION_BASE_PATH"                        = null
          + "BONUS_API_BASE_PATH"                             = "/api/v1"
          + "BONUS_API_KEY"                                   = "to-remove"
          + "BONUS_API_URL"                                   = "to-remove"
          + "CGN_API_BASE_PATH"                               = "/api/v1/cgn"
          + "CGN_API_KEY"                                     = (sensitive value)
          + "CGN_API_URL"                                     = "https://io-p-itn-cgn-card-func-02.azurewebsites.net"
          + "CGN_OPERATOR_SEARCH_API_BASE_PATH"               = "/api/v1/cgn/operator-search"
          + "CGN_OPERATOR_SEARCH_API_KEY"                     = (sensitive value)
          + "CGN_OPERATOR_SEARCH_API_URL"                     = "https://io-p-itn-cgn-search-func-02.azurewebsites.net"
          + "EUCOVIDCERT_API_BASE_PATH"                       = "/api/v1/eucovidcert"
          + "EUCOVIDCERT_API_KEY"                             = (sensitive value)
          + "EUCOVIDCERT_API_URL"                             = "https://io-p-eucovidcert-fn.azurewebsites.net/api/v1"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FF_BONUS_ENABLED"                                = "1"
          + "FF_CGN_ENABLED"                                  = "1"
          + "FF_EUCOVIDCERT_ENABLED"                          = "1"
          + "FF_IO_FIMS_ENABLED"                              = "1"
          + "FF_IO_SIGN_ENABLED"                              = "1"
          + "FF_IO_WALLET_ENABLED"                            = "1"
          + "FF_IO_WALLET_TRIAL_ENABLED"                      = "0"
          + "FF_IO_X_USER_TOKEN"                              = "NONE"
          + "FF_IO_X_USER_TOKEN_BETA_TESTER_SHA_LIST"         = (sensitive value)
          + "FF_IO_X_USER_TOKEN_CANARY_SHA_USERS_REGEX"       = "XYZ"
          + "FF_PN_ACTIVATION_ENABLED"                        = "1"
          + "FF_ROUTING_PUSH_NOTIF"                           = "ALL"
          + "FF_ROUTING_PUSH_NOTIF_BETA_TESTER_SHA_LIST"      = (sensitive value)
          + "FF_ROUTING_PUSH_NOTIF_CANARY_SHA_USERS_REGEX"    = "^([(0-9)|(a-f)|(A-F)]{63}[(0-4)]{1})$"
          + "FF_TRIAL_SYSTEM_ENABLED"                         = "1"
          + "FF_UNIQUE_EMAIL_ENFORCEMENT"                     = "ALL"
          + "IO_FIMS_API_BASE_PATH"                           = "/api/v1/fims"
          + "IO_FIMS_API_KEY"                                 = (sensitive value)
          + "IO_FIMS_API_URL"                                 = "https://io-p-itn-fims-user-func-01.azurewebsites.net"
          + "IO_SIGN_API_BASE_PATH"                           = "/api/v1/sign"
          + "IO_SIGN_API_KEY"                                 = (sensitive value)
          + "IO_SIGN_API_URL"                                 = "https://io-p-sign-user-func.azurewebsites.net"
          + "IO_SIGN_SERVICE_ID"                              = "01GQQZ9HF5GAPRVKJM1VDAVFHM"
          + "IO_WALLET_API_BASE_PATH"                         = "/api/v1/wallet"
          + "IO_WALLET_API_KEY"                               = (sensitive value)
          + "IO_WALLET_API_URL"                               = "https://io-p-itn-wallet-user-func-02.azurewebsites.net"
          + "IO_WALLET_TRIAL_ID"                              = "01J2GN4TA8FB6DPTAX3T3YD6M1"
          + "IO_WALLET_UAT_API_BASE_PATH"                     = "/api/v1/wallet/uat"
          + "IO_WALLET_UAT_API_KEY"                           = (sensitive value)
          + "IO_WALLET_UAT_API_URL"                           = "https://io-u-itn-wallet-user-func-01.azurewebsites.net/api/v1/wallet"
          + "JWT_SUPPORT_TOKEN_EXPIRATION"                    = "1209600"
          + "JWT_SUPPORT_TOKEN_ISSUER"                        = "app-backend.io.italia.it"
          + "JWT_SUPPORT_TOKEN_PRIVATE_RSA_KEY"               = (sensitive value)
          + "LOLLIPOP_API_BASE_PATH"                          = "/api/v1"
          + "LOLLIPOP_API_KEY"                                = (sensitive value)
          + "LOLLIPOP_API_URL"                                = "https://io-p-itn-auth-lollipop-func-02.azurewebsites.net"
          + "MYPORTAL_BASE_PATH"                              = "/myportal/api/v1"
          + "NODE_ENV"                                        = "production"
          + "NOTIFICATIONS_QUEUE_NAME"                        = "push-notifications"
          + "NOTIFICATIONS_STORAGE_CONNECTION_STRING"         = (sensitive value)
          + "PAGOPA_API_KEY_PROD"                             = (sensitive value)
          + "PAGOPA_API_KEY_UAT"                              = (sensitive value)
          + "PAGOPA_API_URL_PROD"                             = "https://api.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_API_URL_TEST"                             = "https://api.uat.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_ECOMMERCE_API_KEY"                        = (sensitive value)
          + "PAGOPA_ECOMMERCE_BASE_URL"                       = "https://api.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PAGOPA_ECOMMERCE_UAT_API_KEY"                    = (sensitive value)
          + "PAGOPA_ECOMMERCE_UAT_BASE_URL"                   = "https://api.uat.platform.pagopa.it/ecommerce/payment-requests-service/v1"
          + "PECSERVERS_aruba_basePath"                       = "/apigateway/api/v2/pagopa/mailbox"
          + "PECSERVERS_aruba_secret"                         = (sensitive value)
          + "PECSERVERS_aruba_serviceId"                      = "01FRMRD5P7H378MDXBBW3DTYCF"
          + "PECSERVERS_aruba_url"                            = "https://pagopa-test.pec.aruba.it"
          + "PECSERVERS_poste_basePath"                       = null
          + "PECSERVERS_poste_secret"                         = (sensitive value)
          + "PECSERVERS_poste_serviceId"                      = "01FQ4945RG5WJGPHKY8ZYRJMQ7"
          + "PECSERVERS_poste_url"                            = "https://poc.pagopa.poste.it"
          + "PECSERVER_BASE_PATH"                             = null
          + "PECSERVER_TOKEN_ISSUER"                          = "app-backend.io.italia.it"
          + "PECSERVER_TOKEN_SECRET"                          = (sensitive value)
          + "PECSERVER_URL"                                   = "https://poc.pagopa.poste.it"
          + "PN_ACTIVATION_BASE_PATH"                         = "/api/v1/pn"
          + "PN_API_KEY"                                      = (sensitive value)
          + "PN_API_KEY_UAT"                                  = (sensitive value)
          + "PN_API_URL"                                      = "https://api-io.notifichedigitali.it"
          + "PN_API_URL_UAT"                                  = "https://api-io.uat.notifichedigitali.it"
          + "PN_CONFIGURATION_ID"                             = "01HMVMHCZZ8D0VTFWMRHBM5D6F"
          + "PN_SERVICE_ID"                                   = "01G40DWQGKY5GRWSNM4303VNRP"
          + "PUSH_NOTIFICATIONS_QUEUE_NAME"                   = "push-notifications"
          + "PUSH_NOTIFICATIONS_STORAGE_CONNECTION_STRING"    = (sensitive value)
          + "REDIS_PASSWORD"                                  = (sensitive value)
          + "REDIS_PORT"                                      = (sensitive value)
          + "REDIS_URL"                                       = (sensitive value)
          + "SERVICES_APP_BACKEND_API_BASE_PATH"              = "/api/v1"
          + "SERVICES_APP_BACKEND_API_URL"                    = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
          + "SERVICES_APP_BACKEND_BASE_PATH"                  = "/api/v2"
          + "TEST_CGN_FISCAL_CODES"                           = null
          + "THIRD_PARTY_CONFIG_LIST"                         = (sensitive value)
          + "TRIAL_SYSTEM_APIM_BASE_PATH"                     = "/manage/api/v1"
          + "TRIAL_SYSTEM_APIM_KEY"                           = (sensitive value)
          + "TRIAL_SYSTEM_APIM_URL"                           = "https://ts-p-itn-apim-01.azure-api.net"
          + "TRIAL_SYSTEM_API_BASE_PATH"                      = "/api/v1"
          + "TRIAL_SYSTEM_API_KEY"                            = (sensitive value)
          + "TRIAL_SYSTEM_API_URL"                            = "https://ts-p-itn-api-func-01.azurewebsites.net"
          + "UNIQUE_EMAIL_ENFORCEMENT_USERS"                  = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_HEALTHCHECK_MAXUNHEALTHYWORKERPERCENT"   = "95"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "npm run start"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "20-lts"
            }

          + auto_heal_setting {
              + action {
                  + action_type                    = "Recycle"
                  + minimum_process_execution_time = "00:05:00"
                }
              + trigger {
                  + slow_request {
                      + count      = 50
                      + interval   = "00:01:00"
                      + time_taken = "00:00:10"
                    }
                }
            }

          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/azure-devops"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-apim-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-platform-api-gateway-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-github-runner-snet-01"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-agw-snet-01"
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.96/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.112/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.128/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.144/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.160/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.176/28"
              + name       = "rule"
              + priority   = 65000
            }
        }
    }

  # module.application_gateway_weu.module.app_gw.azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway"
        name                              = "io-p-appgateway"
        tags                              = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [
              - "io-p-app-appbackendl1.azurewebsites.net",
              - "io-p-app-appbackendl2.azurewebsites.net",
            ] -> null
          - id           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/backendAddressPools/appbackend-app-address-pool" -> null
          - ip_addresses = [] -> null
          - name         = "appbackend-app-address-pool" -> null
        }
      + backend_address_pool {
          + fqdns        = (known after apply)
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "appbackend-app-address-pool"
        }

        # (111 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.2.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.0.4"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 22 to add, 9 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.apim_itn.module.apim.azurerm_api_management.this,
  on .terraform/modules/apim_itn.apim/main.tf line 18, in resource "azurerm_api_management" "this":
  18: resource "azurerm_api_management" "this" {

`key_vault_id` has been deprecated in favour of `key_vault_certificate_id`
and will be removed in v5.0 of the AzureRM provider

(and 23 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
